[{"body": "Is there a way to make money off student loan defaulting?", "title": "Making money from student debt (investing)", "comments": "I added topic flair to your post, but you may update the topic if needed ([click here for help](/r/personalfinance/wiki/flair)).\n\nYou may find these links helpful:\n\n- [\"How to handle $\"](http://www.reddit.com/r/personalfinance/wiki/commontopics)\n- [Investing wiki page](http://www.reddit.com/r/personalfinance/wiki/investing)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/personalfinance) if you have any questions or concerns.* Become a debt collector, buy defaulted student debt, and attempt to collect on it. You could consider putting some money into a site like [LendingClub](http://www.mrmoneymustache.com/the-lending-club-experiment/). ", "date": 1451635200.0, "upvotes": 0, "flair": "Making money from student debt (investing)"}, {"body": "My significant other had been hired by a company my father is a supervisor at, and was fired at the end of his second day by a supervisor that had it out for him for having ties to my dad. Anyways, he turned over all company property to my dad, and never received his final wages. He started and was fired in June 2015. \n\nI was opening mail today and there was a W2 stating he had $199 in taxable wages (not even accurate- he worked 20 hours at 16.50 an hour- they have a ten hour work day standard and work four days a week). We are both young and inexperienced, and have no clue how to rectify this situation- can you point us in the right direction, r/personalfinance?", "title": "Taxes, Unpaid Wages: My significant other never received final wages for two days work, W2 came in the mail. (MO)", "comments": "What state are you in?  Call your state employment board and file a case. Unpaid wages will get resolved within few weeks of you filing a case. How much did he physically receive? If they paid him 199, the W-2 is correct from the IRS standpoint.\n\nHe should file a claim with the state department of labor for the unpaid wages, but that check if it arrives is 2016 income, because the check will be dated 2016, so its ok to do your taxes now assuming he actually received a check for 199.\n\nIf he got paid nothing, did he ever call anybody in accounting,  to see what happened to the paycheck?\n The better forum is /r/legalexperience.  More importantly than the next-to-nothing tax bill that was issued is the fact that you guys are sitting on a fairly large unpaid wages claim.  Missouri allows you to demand payment in writing. After a waiting period, a fine equal to his pay rate times the number of hours worked is applied.....for a maximum of 90 days.  So he's sitting on a potential to get 3 months of backed wages *provided* that he moves forward correctly.\n\nI'd be speaking to a labor attorney in the area ASAP. Contact Texas Dept of Labor ", "date": 1451635200.0, "upvotes": 13, "flair": "Taxes, Unpaid Wages: My significant other never received final wages for two days work, W2 came in the mail. (MO)"}, {"body": "So this year I tried to file taxes by myself. One because its free with TurboTax and two because it's easier than for me to drive to somewhere for someone else to do it for me. In the previous year, I got about $200-$400 dollars on my refund. But with TurboTax, this year it says I owe the Feds about $300 and I get a refund the from the state about $200. So a net loss of $100. I don't remember doing something special or different this year. I live in the same place. I have the same job. I had a raise and a bonus. But it feels like I am getting penalize. Or maybe I am thinking about this all wrong. Can someone please clarify this for me?", "title": "Help Me Understand My Tax Situation", "comments": "The total amount you owe in taxes is a fixed number. For illustration, let's say this is $10,000.\n\nLast year, when you got a $400 refund, that was because you actually had $10,400 withheld from your paychecks - an amount in excess of your tax liability. \n\nThis year, you had a raise and a bonus, which increased the amount you owe in taxes. If you had a fixed amount withheld each year, say still $10,400, but your liability has gone up to $10,500, then you end up owing an additional $100. ", "date": 1451635200.0, "upvotes": 0, "flair": "Help Me Understand My Tax Situation"}, {"body": "I am a millenial and am considering joining a prominent private club on the West Coast whose membership primarily consists of older business men and women. The initiation fee is $10,000 (supposedly considered equity). Monthly dues are $425. Club facilities include a dining room, bar, meeting rooms, ball room, gym. My household income is certainly above average and possibly on par with most of the other members, but I highly doubt my net worth.\n\nWill joining this type of club open up new business opportunities and relationships? Will I see a return on my investment?\n\nAs a young millenial, will i be perceived as pretentious or over-ambitious by the other members of the club whose firm I could be interviewing with in the near future?", "title": "Is it worth it to join a private, business club?", "comments": "It depends what field you are in and what your goals are. I need more information about you and the club before offering an opinion. Some of these clubs are by invitation only, just fyi. This sounds like some snooty hob knob club for old men.  I personally would find no benefit to joining a club like that, even for the business networking aspect, unless of course those people are players in your industry.  But if you're not a business owner, what would you need to join for? ", "date": 1451635200.0, "upvotes": 0, "flair": "Is it worth it to join a private, business club?"}, {"body": "I am a US-citizen from Ohio living abroad long-term in Japan. My contract is yearly, but my assignment will last 3 years minimum should things go well. I've been here since the end of May 2015. I work full-time (~40 hours/week) and pay for and receive Japanese national health insurance. I have been in the US twice no longer than 9 days at a time since moving.\n\nRecently I've been receiving alarming emails from HeatlhCare.gov talking about \"avoid[ing] the penalty for 2016.\" I realize today is / yesterday was the \"deadline\", so I'm a bit last-minute on this, but... Am I going to be penalized for not subscribing to a US health insurance plan? Do I have to notify the US government of my living abroad? My Dad said he looked into it and I should be fine and just ignore the emails, but I never feel comfortable just doing nothing.\n\nTo boot, I forgot my password and for some reason cannot recall the exact format of my security question answers either, soooo I have to call them. From Japan. On Skype. Which makes my situation all the more challenging if I DO have to take action.\n\nThanks in advance!", "title": "US Citizen Living Abroad: Health Insurance Penalty?", "comments": "Have you tried to research any of this yourself? A simple google search gives you your answer, but here I'll spoon feed you.....If you live outside the US for at least 330 days you are exempt from the healthcare requirements.\n\nStart here: https://www.healthcare.gov/health-coverage-exemptions/exemptions-from-the-fee/ ", "date": 1451635200.0, "upvotes": 0, "flair": "US Citizen Living Abroad: Health Insurance Penalty?"}, {"body": "So I actually took to pen and paper before I decided to post because I wanted to get my thoughts out in a clear fashion. \n\nOkay, so 8 years ago I turned 18 and that is where this story begins. Hope you like story time! \n\nOur story begins in a far off universe called West Virginia. A young FactArchitect had just become a man as stated by the great Financial Kingdom doctrine. (*Just a small backstory and some family history to give you an idea of my financial role models:*\n\n**Dad -** *Police officer. Love this man to death, but he has never been great with money.  I watched his Camero get repo'd as a kid and then during my college years I watched his Dodge Durango get repo'd. Being a police officer in West Virginia didn't help being as he made 27,000$ a year to end up getting shot in the end of his career (Yes he made it )* \n\n**Grandmother -** *Best cook on the earth, but also terrible with money. She owned a small town diner for 25 years. What killed the diner you ask? Well instead of paying the employees she paid my ~~deadbeat~~ aunt's bills for her.*\n\nSo where were we? Oh yes, So a young FactArchitect had just turned 18 years old. This was in 2007 so before the Fair Credit Reporting act in 2009. Mmm - Y'all remember that free pizza we got for signing our life away? \n\nWell Christmas time is near and I had gotten this fresh piece of plastic. I remember it so well as it was so beautiful. *(I had a Van Gogh's Starry Night) ;)* My mother told me \"Buy some clothes for your Christmas gift and I'll pay the card off.\" Being young and naive to the ways of the world  I took her up on the offer. Only to end up getting in an argument with her when she moved out and refused to pay the bill. So young me did what young me was really good at.. I ditched the bills and hid from the debt collectors until it went to collections and the calls stopped coming.  \n\nJust so you know young me had no idea how important credit was at the time.\n\nWell in time me and my mother makeup and I she asks me for another favor.. as if being burnt the first time wasn't bad enough I let her up the bills for her house in my name. All was fine and well, until she told me she was moving back out of state. I'm okay with this until I start receiving bills in the mail and debt collectors calling me every day. A 600$ Direct TV bill, 300$ Power bill, and one enormous argument later.. I was homeless for the first time in my life.. \n\nNow don't feel bad for me, maybe I use the word homeless to laxly. Two hours later me and my dad are back in our house that is in heirship.. that doesn't have power, but we're together again. Just the guys... the bachelor's and our dog.  \n\nMe and my mother didn't talk for over a year after that fight, but it's that fight and my mother that I attribute most of my financial knowledge to. That moment led me to not trust family anymore when it comes to finances. I wanted to learn how to be financially responsible and I started taking an awareness to the situation at hand. Though it had scared me and I shyed away from accepting responsibility for a long time.. I'm trying to take control back now.\n\nSo let's get up to speed. \nLast year it had been 7 years that most of the bad marks on my credit had fallen off. Others I was able to dispute with the use of a lawyer as prior to 2009 much of the documentation on my debts were lost. \n\n**Currently, I have:** \n\n9000$ Student Loan Debt \n\n9900$ Car Loan (Trying to keep up with the Joneses)\n\n200$ Bad credit card debt (Tried to build credit, but failed.. was going through rough patch mentally; Better now)\n\nThere are a few things I'm trying to do with my life right now. I just quit my job and moved to a college town where I managed to get a better paying job, with that is only 4 miles from where I live *(compared to the 50 mile round trip drive to and from work before)*\n\n**First:** I'm scheduled to go back to school starting in the fall semester. I wish I could turn back time and give young me Zac Bissonntte's - Debt Free U. Though sadly, time travel isn't possible yet..*(as far as I know)* I would make sure to pay my debt off as it accrued, but as I cannot do that right now and I am going back here in the fall I would like to try and pay down my debt while in school. \n\n**Second:** Unfortunately I didn't have Zac's second book until a few months ago. Last year I decided to take over my car payment from my pops. This car was in his name, but now it is not. The car has been a reliable care 40mpg 2012 Ford Focus, but recently I was in an accident which caused 2500$ in damage. Luckily, insurance covered all but 350$ of the damage. I'm looking to possibly trade my vehicle off as I'm not so worried about the gas mileage anymore, but more worried about the versatility of my vehicle. If I had read Zac's book prior.. I would have purchased a 1500$ reliable 4wd vehicle and saved my cash, unfortunately I did not. So now I'm stuck with the 9500$ Loan.. I am weighing the option of trading it in on something similarly priced, but 4wd. Not really worried about look/name.. Just want something reliable. So I'm looking on suggestions for this one here as this will be one of my bigger decisions. \n\n**Third:**  Of course I would love to pay down this debt. Infact that is one of the main reasons I'm posting here today. So I would love some suggestions or input on where to begin. \n\n**Fourth:** I had read https://www.reddit.com/r/offbeat/comments/3zpipt/study_finds_63_of_americans_are_one_500_surprise/ and to be honest it scared me. I want to start an emergency fund pronto. \n\n**Fifth:** I know this is a longshot due to me already having debt with the car and student loans. Currently, moved in with my grandmother to help care for her while I go to school and work full time. Honestly though our rent is 1100$ monthly, and I only pay 400$ of it. I plan to live in this college town for at least 5-6 years if not more. I really love it here and would love to invest in a future, but everything I've read has said to steer clear of housing until debts are paid off. \n\n\n**tl;dr? Well! just looking for some suggestions on where to start. Debt, Emergency Fund, Car, School, House**\n\nI want to thank anyone for any suggestions or input they may have.\n\n\n", "title": "The story of FactArchitect and requesting help", "comments": "Step 1: Construct a budget. Sounds like you have some wiggle room, but build a reasonably aggressive budget and stick to it. Cut entertainment and any vices like cigarettes and alcohol as much as you can.Prepare all your own food. \n\nStep 2:Build an emergency fund of 1-2 months living expenses in a savings account with your bank of choice. \n\nStep 3: Car- you have a car that is under 5 years old with a reasonable debt. Keep paying the  minimum for now. When you have fulfilled points 1&2, dump all additional money on the car loan until you owe less than 75% of its fair KBB resale value. \n\nStep 4: Sell the car. This will be a balancing act based on the fact that you still have a loan, but find a way to sell it at this point. \n\nStep 5: Don't know where you live, but after selling the car and settling that debt, buy a good reliable late model car under $5k cash. if you need an suv, look at an older toyota 4 runner\n\nStep 6: Stash cash until you have 3-6 months living expenses in an emergency fund\n\nStep 7: Aggressively pay off student loans and CC debt. \n\nStep 8:Keep the toyota as long as it runs and keep stashing savings. \n\nThis will be a \"long haul\" situation, but you aren't that bad off ", "date": 1451635200.0, "upvotes": 0, "flair": "The story of FactArchitect and requesting help"}, {"body": "A previous part time job sent me a letter saying they were sued and had to provide a retirement plan for employees in the past ten years.\n\nI've been receiving letters from TIAA CREF about the plan for the past year now, and I want to know what I can do with the money. It is <$200, and is in a tax deferred annuity plan.\n\nMy current job does not have a retirement plan, instead I have been maxing out a Roth IRA, and I don't have a 401k. ", "title": "What to do with a small annuity from previous job", "comments": "", "date": 1451635200.0, "upvotes": 1, "flair": "What to do with a small annuity from previous job"}, {"body": "You can skip to the second paragraph if you don't want background. \n\nTo keep it as brief as possible, I live at home and get every necessity paid for except for my car, insurance, and gas. Thusly, I work the bare minimum to cover my costs (biomedical student and competitive powerlifter) so that I can spend as much time as possible on things I enjoy/have to do. I have 0 real credit card debt (use it monthly on gas but pay it 100% at the end of the month), tuition 100% covered by scholarships, but only ~2000 in savings. Car should be paid off before I'm 24 and will be in my name (giving me a decent asset) so saving will be easier. Expenses are limited for the most part, but they are mostly wants. I give all the background in the hopes that the readers can get an idea of how I approach these situations. \n\nMy real question/concern lies with the mountain of debt I'll get from (hopeful) medical school. Will the quart million+ in debt from medical school set me back despite good career prospects? Is there anything I should be doing now to help me set up the future (I set aside 25-150 dollars a month now that I can)? ", "title": "21 (m) stressed over future/retirement", "comments": "I added topic flair to your post, but you may update the topic if needed ([click here for help](/r/personalfinance/wiki/flair)).\n\nYou may find these links helpful:\n\n- [Retirement Accounts wiki page](http://www.reddit.com/r/personalfinance/wiki/retirementaccounts)\n- [\"How to handle $\"](http://www.reddit.com/r/personalfinance/wiki/commontopics)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/personalfinance) if you have any questions or concerns.* [deleted] To get this out of the way. Your car (when paid off) isn't a \"decent asset\". Cars are technically an asset as they hold monetary value, but they are similar \"assets\" to something like a cell phone, tv or computer. Do they hold value? Yes, but the depreciation they experience makes them questionable as true assets. Real assets retain value and grow. Think things like well picked home purchases, 401k accounts and well chosen taxable investments. \n\nWith that out of the way...\n\nBy choosing to pursue an MD with debt, you are making a bet. The bet is not only that you will complete the degree, but that you will earn an income after graduation that will allow you to pay your loan payments. \n\n$250k in student loans may not be unreasonable if your plan is go to a great medical school, graduate, and get a job that will pay you a salary that can allow you to pay them back. In the first 5 or so years, the goal may be that you can make the minimum payments (on an income based repayment) on your student loans to get by. After that timeline, you must make sure your minimal/moderate salary prospects suggest you can begin paying these loans back aggressively. \n\nOnly you own the facts and knowledge to make this type of decision based on your current and past record as a student (since you haven't laid them out here). If you are an average to below average student at an average to below average school the above may be unattainable. If you are a pretty good student at a pretty good school with moderate career aspirations beyond that than go for it. \n\nTo put numbers behind all of this (especially as you haven't listed your potential medical specialty) if you conservatively see yourself making more than $125-150k by the time you are 30 and are committed to living very frugally (5-10 year old Japanese car, owning or renting property in a low to middle income neighborhood, eating out nearly never) then go for it. If not, this could be a pipe-dream/financial plague for many years. \n\nTl;dr: Base your future financial prospects on the average, not the ideal or anecdotal. If the math works out and it follows your past trajectory in terms of grades/ work experience, go for it. If not, think very critically about the amount of scrap and gusto on your part it will take to get you there. If you don't have it in you, don't proceed. \n Most medical doctors make a lot of money once they have finished their studies. That means that often they can pay back this huge amount of debt in just a few years, if they focus on that. And after that, they also have a huge cash flow of which part can be reserved to build a nice amount of assets.  \n\nA lot of them let some personal finance adviser manage their wealth, which is costing them a lot of money. I like a specific website's take on this: [the white coat investor](http://whitecoatinvestor.com/what-do-advisers-think-about-doctors-2/).\n\nFinally, by taking on this debt, you are investing in your own future. However, a small percentage of medical students will not make it, for some reason. Some get ill, some get burnt-out, etc. This is a risk that you will be taking. Live lean during your study, so that you aren't increasing the burden more than you have to, and yes, I would also try to pay it down as soon as you can, to get it off your back. ", "date": 1451635200.0, "upvotes": 1, "flair": "21 (m) stressed over future/retirement"}, {"body": "Hello personalfinance, I am new to Reddit and fairly new to investments. I am trying to get an understanding of how they work. \n\nI have a pretty good chunk of money invested with Edward Jones and my entire family has used this company for probably a good 30 years. \n\nAfter reading a lot about Edward Jones not being the best business to invest with, and not really knowing much about investment to begin with, I approached my family with my concerns about their shady business policies.\n\nMy family has told me that the guy we do business with is a \"good guy\" we have been with them forever, he has our best interest in mind, and so on. They don't seem to have an understanding how our investor makes money and what other companies are out there that might be better options instead of Edward Jones. \n\nSo my question is, is Edward Jones a poor option to invest with? How are they different from other options? And what can I tell my family to get them interesting in looking into this as well? \n\nThank you. ", "title": "Questions about Edward Jones. New to personal finance. Thank you!", "comments": ">So my question is, is Edward Jones a poor option to invest with?\n\nYes.\n\n>How are they different from other options?\n\nThey differ from the good investment options by charging high fees and not necessarily giving financial advice that is in you or your family's best interest.\n\n>And what can I tell my family to get them interesting in looking into this as well?\n\nProbably nothing.  You can't convince illogical people with logic.  If you wanted to try, start by showing them [this page illustrating the effect of high expenses on investment returns](https://personal.vanguard.com/us/insights/investingtruths/investing-truth-about-cost).\n\nMeanwhile, get your own money out of there ASAP. They're not inherently evil but they will likely invest you in high expense ratio funds that have a front-end load of 5.75%.  So for every $100 you invest, only $94.25 is actually invested in the fund, the rest is kicked back to them/the fund managers. There is zero reason to invest in funds with a load (outside of a 401k if that's the only option and that's the only way to get the employer match). [deleted] \"The guy\" receives commission, that's why he is so nice. Go with Vanguard or Fidelity and stop the rip-off. There should be NO FEES. And a low expense ratio of 0.1-0.5%.  It is important to understand that a broker is a salesperson who is paid by commissions. Most of us prefer to work with someone who is a fiduciary, and who does not sell commissioned products. [removed] ", "date": 1451635200.0, "upvotes": 1, "flair": "Questions about Edward Jones. New to personal finance. Thank you!"}, {"body": "I want to maximize what I get back. I am getting paid well now and am paying an arm for student loans. Should I start going to a professional? Or paying for upgraded online services? ", "title": "At what point should I stop doing my tax return online for free?", "comments": "Do you own a business, rental properties, or are self employed?\n\nIf the answer is no, Turbotax/Taxact/whatever will likely be just fine. If you have simple tax returns (take standard deduction, have primary home interest, student loans), then you should use the free versions. It's when you own rentals, are self employed, etc, that you may want to start considering hiring a professional.  Title question: Pretty much never, unless your agi is over 62k or you have special circumstances.\n\nAlways start with the free stuff - it will tell you of you need to upgrade when you start putting in certain info  When your tax situation starts to become more complicated. Once you start a family, start your own business, or get some investments like stock or property, you would likely be better off having a professional help you. \n\nIf you are single and earning a single income, or even married and the two of you each have an income, (free) online software should be more than enough. ", "date": 1451635200.0, "upvotes": 2, "flair": "At what point should I stop doing my tax return online for free?"}, {"body": "I submitted my return from the wrong app. \nI had entered my husbands and my W2's and one form from unemployment that I had collected for a few months on the TurboTax app and was ready to file, but it cost too much. \nSo I also started entering the info on the Tax Slayer app which was cheaper.\nThen I was interrupted and didn't get back to working on finishing it up until a good while later. \nI incorrectly thought that the Tax Slayer app was the one that I had all of our info entered into and I submitted our return from there. \nIt was not. \nI submitted a joint return that only consisted of my husbands W2. None of my forms were included. The return has been accepted as of Friday morning but not approved yet. \nI called the IRS to see what I should do to fix my mistake and they told me to file an amended return. But they also said that it's possible that we might receive a direct deposit return on time anyway. \nDoes anyone have any experience with this? It would be awesome if that really happens! The difference was only around $250. They said they didn't know whether or not the funds would come thru. So that's what I'm wondering. If anyone has any insight to offer, I would greatly appreciate it! ", "title": "I messed up my tax return. Probably very badly...", "comments": "If the (incorrect) original return was accepted and you input your refund direct deposit information correctly, you should receive the (incorrect) refund within the 21 days normal processing timeframe.\n\nThen you would prepare and mail the amended return on Form 1040X. It's possible you would receive another refund, or owe a balance due. You might have incorrectly formatted line breaks. To create a line break, either put two spaces at the end of the line or put an extra blank line in-between lines. ([See Reddit's page on commenting for more information.](http://www.reddit.com/wiki/commenting))\n\nI have attempted to automatically reformat your text with fixed line breaks.\n\n----\n\n> I submitted my return from the wrong app. \n\n> I had entered my husbands and my W2's and one form from unemployment that I had collected for a few months on the TurboTax app and was ready to file, but it cost too much. \n\n> So I also started entering the info on the Tax Slayer app which was cheaper.\n\n> Then I was interrupted and didn't get back to working on finishing it up until a good while later. \n\n> I incorrectly thought that the Tax Slayer app was the one that I had all of our info entered into and I submitted our return from there. \n\n> It was not. \n\n> I submitted a joint return that only consisted of my husbands W2. None of my forms were included. The return has been accepted as of Friday morning but not approved yet. \n\n> I called the IRS to see what I should do to fix my mistake and they told me to file an amended return. But they also said that it's possible that we might receive a direct deposit return on time anyway. \n\n> Does anyone have any experience with this? It would be awesome if that really happens! The difference was only around $250. They said they didn't know whether or not the funds would come thru. So that's what I'm wondering. If anyone has any insight to offer, I would greatly appreciate it!\n>\n\n----\n\n^(I am a bot. Contact) ^[pentium4borg](https://www.reddit.com/user/pentium4borg) ^(with any feedback.) ", "date": 1451635200.0, "upvotes": 1, "flair": "I messed up my tax return. Probably very badly..."}]