[{"body": "So I went to a for profit school during the recession of 2008...Young and dumb as it gets. I had no idea what holy hell I was signing up for. At this rate I'll never own a home or be able to afford to be a parent...I'm kind of just bla at this point. I pay between $1300-1600 a month. It's by no means easy. I'm almost 30 and have another 20 years of this. It's caused the use of credit cards often to get by. I desperately need to release my parents as co-signers as they recently opened a small business and the ties to my debt is harming them. Anywho, I got a call from GM llc. They want to help me sue my lender for predatory lending practices. Anyone ever hear of them or know of this? I know several law suites are active against Navient. I just don't trust anything anymore. There's so many scams!", "title": "$175k private loan debt. Currently paying $1600 a month..anyone heard of GM LLC law firm? Need advice!", "comments": "It's illegal for attorneys to solicit business over the phone FYI. It may be legit and you may want to hire them, but keep that in mind. If you hire them, be sure you know how they'll be paid - will they sue other company for attny fees? Work on a contingency basis? They're required to give you a written contract which you should sit down and actually read before signing.  I've done some research on GM law firm LLC , there's a firm under that name in Boca Raton Florida, they seem to have an office in a commercial suite that has a few other law groups, but their web page has an attorney's page, that leads to each of their individual Florida Bar Registrations.  \n\nSome images: http://imgur.com/a/d61z3\n\nThey seem reputable enough, but I'd exercise extremely caution, and to confirm that these people called you, instead of someone immitating them\n\nEdit: reading through their Bios Ms. Grant seems to specialize in fighting private student loans. \n\nIt'd be worth a call to the real office and inquire if they contacted you. Also remember never just hand over your money to someone no matter how trust worthy they seem, use rational criticism when making the decision to go ahead with this or not  You might want to check this out http://www.legalservicescenter.org/get-legal-help/predatory-lending-and-consumer-protection-unit/project-on-predatory-student-lending/ What is the interest rate? What is your net income?  That does seem extreme...can you file for bankruptcy since it was a private loan? Speak with a lawyer about your options. Don't trust a random company. ", "date": 1483257600.0, "upvotes": 4, "flair": "$175k private loan debt. Currently paying $1600 a month..anyone heard of GM LLC law firm? Need advice!"}, {"body": "should I contact my insurance? \nShould I contact them and be like had a bump (got zero details and there was no damage but worried he might claim) or should I just say nothing and see if anything happens?\n\n:/\n\n", "title": "Bumped into a car this morning, I gave them my details forgot to get theirs, there was no damage on either car (although it was darkish) and they seemed alright. I'm now worried they might claim either because they feel they can or they might fimd something legit in brighter light?", "comments": "At this point I would probably wait.. In the future always call the cops. I wouldnt give a stranger my info without a police report. ", "date": 1483257600.0, "upvotes": 3, "flair": "Bumped into a car this morning, I gave them my details forgot to get theirs, there was no damage on either car (although it was darkish) and they seemed alright. I'm now worried they might claim either because they feel they can or they might fimd something legit in brighter light?"}, {"body": "I don't really have much expenses at all honestly. 18, live with parents, and work part time making ~21k a year. I'm wondering what would be a better idea; either paying it off as fast as I can with high monthly payments, or low monthly payments over a few years.\nThank you guys!", "title": "Should I finance a car for a long time with low monthly payments, or quick and high monthly?", "comments": "You want to minimize interest, which usually means a shorter repayment cycle.\n\nIf your loan was 0% interest for some reason, then taking a long time to repay would be fine, though. The sooner you pay it off the less interest you pay and most of the time the rate is lower and a shorter term.  It's all your choice. Example if you want to get a car for 5 years installment and the price is 1.2m you can get that car for only 20k per month but depends on your down payment if your downpayment is 300k you can get that car for 12k per month for 5 years. I think the more down payment you have is also a good strategy. Other than the fact longer financing usually has higher rates, if you can finance longer, but pay much more, you will save money without the added risk of HAVING to pay the extra. This is ONLY if you have the discipline to do that. Few things to consider:\n\n1. For your age and income, most likely you will not qualify for low-interest rate irrespective of the loan tenure. For rate > 2.99% don't go for a long term loan. I would suggest asking your parents to co-sign the loan(if they are comfortable and you think it would put a dent in their financial security if you fail to pay for the car) if that helps you in getting a lower interest rate.\n\n2. When you have a lien on the car, the lender will want an auto insurance policy according to his requirements and it can be expensive especially if you are < 25 years. Double check the insurance quotes based on lender's requirements because you will need that level of insurance until the loan is repaid fully. Again adding to your parents' insurance policy will be cheaper.\n\n3. It also depends on what other loans you anticipate to take in next 3-6 years. Your ability to get another loan will be less because the lender will check your repayment capability and see that you are already making monthly payments towards your car.\n\n ", "date": 1483257600.0, "upvotes": 1, "flair": "Should I finance a car for a long time with low monthly payments, or quick and high monthly?"}, {"body": "My husband's grandfather passed away last week. Before he died, he told my inlaws that he wanted us to have his car (the one we have is *very* old and on its last legs, and he was worried about us). This is a great opportunity so we are going to buy it from his grandma (who owns the car outright). \n\nThe deal is, $10,000 to be paid in monthly payments. We're thinking $200/mo for 4 years. I have no reason to suspect anything shady, or any problems arising, but just for everyone's protection I'm wondering what the best way to handle this is to prove all around that we're making the payments on time, in full, etc. What's the best way to establish a paper trail? Checks, money orders, PayPal...something else I haven't thought of yet?\n\nThanks in advance!", "title": "Buying a car from family. What's the best way to establish a paper trail for our records?", "comments": "When I did this ages ago with my Grandmother I just wrote up a contract (word document) with the terms that we both had agreed upon. We then printed two copies and had them both signed with a Notary Public (ups / fedex stores usually have them). \n\nFrom there the checks you write are all the paper trail you need. How is your credit? Are you a member of a credit union? If the car is reasonably new, and you have reasonable credit, you might just take out a loan. Yes, you will pay interest, but with me for example, I got under 2% for a 4 year loan.\n\nFirst, it would just give your grandmother-in-law $10,000 today, instead of dealing with her having to keep track of payments. Second, what if she (god forbid, of course) passes away in less than 4 years? This way, your credit union holds the title, so there's no bad blood, tricks, full payment due to the estate, etc to worry about with family before you get the car titled over to you. A piece of advice that I've kept for years is that there is always the honeymoon period, but you always write the contract up to take care of the figurative \"divorce.\" If there's a falling-out between you and grandma in law, or if there's a fight between you and in-laws, or challenges to the will, etc then you just paid $200 a month out the window. ", "date": 1483257600.0, "upvotes": 1, "flair": "Buying a car from family. What's the best way to establish a paper trail for our records?"}, {"body": "I'm 15 and I feel it's important that I understand how money works, what words like 'interest' and 'APR' mean? Where is a resource I could use to learn the basics of how money/financing stuff works? ", "title": "What is an easy-to-understand book/video/etc. explaining how financing works?", "comments": "You may be interested in our [**reading list**](http://www.reddit.com/r/personalfinance/wiki/readinglist).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/personalfinance) if you have any questions or concerns.* From the reading list, these two are aimed at a young audience: \n\nThe Money Book for the Young, Fabulous & Broke by Suze Orman.\n\nI Will Teach You to be Rich by Ramit Sethi. Khan academy if you prefer videos over books  ", "date": 1483257600.0, "upvotes": 2, "flair": "What is an easy-to-understand book/video/etc. explaining how financing works?"}, {"body": "Hello r/Personalfinance\n\nI work in the entertainment industry and am currently jacked onto an old agency deal that provides them with 10% of my salary (I know, I know...but I'd have to leave my current job to change it blegh..another post entirely)\n\nNo intentions of turning this into an IANAL situation...I BELIEVE this is a semantics/math discussion.  According to my agent I'm supposed to pay them on a  \"quarterly basis calculated off of the gross income each year.\"\n\nHere's what my payments were last year\n\nJan 2,625\nApr 2,625\nJul 2,625\nOct 2625\n\nWhich, would be 10% of a 105,000 gross salary.  Thing is... I didn't make $105,000 gross in 2016. Due to a shift in my contract from an old deal to a new deal I only made $99,506 gross.\n\nSo how does that work?  are those numbers appropriate for a  \"quarterly basis calculated off of the gross income each year\"  If not what should I say when I point it out?  THanks in advance you guys are awesome.", "title": "[Other] Is my agency ripping me off?", "comments": "Ask them to refund the excess $500 that you paid. \n\nYour payments should've been about $2,487.65 per quarter to get to the proper percentage.\n\nIf you/they knew in advance, then you should've did lower payments from the start. If you both thought you were on track to make $105,000 last year (assuming they'll refund the difference), then it's an honest mistake.\n\nOh, and of course I'm not a lawyer :)  ", "date": 1483257600.0, "upvotes": 3, "flair": "[Other] Is my agency ripping me off?"}, {"body": "I just relocated and am currently living in a temporary place for a few weeks (my mail has officially been forwarded to this address) while I move into my permanent address later next month.  I want to file my taxes right away.  I'm unsure which address to use when filing my taxes.  My old address, current address or the address that will become my permanent address in a couple of weeks?", "title": "I just relocated and have a question regarding which address to use when filing my taxes", "comments": "You may find these links helpful:\n\n- [Tax Software Megathread](http://redd.it/5ohy01)\n- [Taxes wiki page](https://www.reddit.com/r/personalfinance/wiki/taxes)\n- [Understanding tax brackets](https://www.reddit.com/r/personalfinance/wiki/taxes#wiki_eli5.3A_taxable_income.2C_tax_brackets.2C_marginal_tax_rates)\n- [W-4 IRS Withholding Calculator](http://www.irs.gov/Individuals/IRS-Withholding-Calculator)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/personalfinance) if you have any questions or concerns.* Definitely NOT your old address.\nAs far as your current or your new - it really depends. I presume you'll be able to forward your mail from your current to your new when that time arrives.\nThe question is what would happen to mail that arrives at your soon-to-be-new address before you are actually there.\nIf it is returned to sender, that will delay your refund by quite a bit.\nThe safest option is to use your current and if you move before receiving your refund, it will be forwarded with your other mail. ", "date": 1483257600.0, "upvotes": 3, "flair": "I just relocated and have a question regarding which address to use when filing my taxes"}, {"body": "Between graduation and getting a job I fell behind on some of my student loan payments. The loans I fell behind on are slightly lower interest rate. Would it benefit my credit score to pay off an account with a 90 day delinquency first, or should I just pay the highest interest loan first (about .5% higher)?", "title": "Is there a credit score advantage to paying off an account that had delinquent payments?", "comments": "You may find these links helpful:\n\n- [Credit-related wiki pages](http://www.reddit.com/r/personalfinance/wiki/index#wiki_credit)\n- [Credit Reports](http://www.reddit.com/r/personalfinance/wiki/credit_reports)\n- [FICO / Credit Scores](http://www.reddit.com/r/personalfinance/wiki/fico)\n- [Improving Credit Scores and Building Credit](http://www.reddit.com/r/personalfinance/wiki/credit_building)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/personalfinance) if you have any questions or concerns.* > Would it benefit my credit score to pay off an account with a 90 day delinquency first, or should I just pay the highest interest loan first (about .5% higher)?\n\nYes it would benefit your credit score to pay off the delinquent account(s) first.  You want to keep accounts from getting more delinquent if at all possible.  Once they are 90 days late, it's hard to undo the damage unless you can get a pay-for-delete. ", "date": 1483257600.0, "upvotes": 1, "flair": "Is there a credit score advantage to paying off an account that had delinquent payments?"}, {"body": "I have about $20,000 in an Everbank Money Market Account earning .61% APY. I'm looking to start saving more aggressively ($1500 a month) and considering moving my money it to one of the online banking sites that offer .95%-1.00 APY. \n\nIs it worth the trouble? Do PF readers like these accounts like Discover, Barclays, and Ally? Or should I do something else with my money?", "title": "Move money from Money Market to Online Savings Account?", "comments": "Yep, the online savings accounts are great for cash savings. Goldman Sachs and Synchrony even pay 1.05%\n\nWith that much money you might consider doing some investing (do you have a Roth IRA?). Ally is usually the recommendation on this sub, but what is this money for? Is it a liquid emergency fund or some other type of savings that will be drawn upon in a few years? \n\nIf you have achieved a strong E fund and are not saving for anything in particular, I would really look into the sidebar about investing. That way you can make that $1500 dollars a month grow significantly. Is it worth the trouble? With your $20,000 which hopefully grows to $38,000 over the year, the difference will be roughly $120 for 2017. Is that worth it to you? Given how it'll probably take at most an hour of your time to make this change, I would say it is. \n\nWhat are you saving for? If you're saving for a goal that is going to happen soon (like a downpayment on a house in 3-5 years), then keep the money in savings. \n\nIf you are investing for retirement, you should look into [retirement accounts](https://www.reddit.com/r/personalfinance/wiki/index#wiki_retirement_accounts). ", "date": 1483257600.0, "upvotes": 2, "flair": "Move money from Money Market to Online Savings Account?"}, {"body": "It's the time of year bonuses get paid out. Is it a better idea to start an emergency fund or payoff credit card debt. Obvious answer seems to be payoff credit card debt, with the assumption you can use credit card in an emergency, but maybe that's the reason that built up credit card debt. ", "title": "Payoff credit card debt or establish an emergency fund?", "comments": "What interest rate does your credit card have?\n\nWhat interest rate would your emergency fund have?\n\nPay the one with the higher interest rate. I'm guessing it's not a contest.  >  but maybe that's the reason that built up credit card debt.\n\nWas that the reason? Something tells me it wasn't if you are rhetorically posing the question to yourself. \n\nI would pay off the CC debt, cut up the CC if you cant control yourself and start on the E fund ASAP. You may find these links helpful:\n\n- [What's the best way to pay down my debt?](http://www.reddit.com/r/personalfinance/wiki/debt#wiki_what.27s_the_best_way_to_pay_down_my_debt.3F)\n- [Dealing with collections](http://www.reddit.com/r/personalfinance/wiki/collections)\n- [Credit Repair](http://www.reddit.com/r/personalfinance/wiki/credit_building#wiki_i_have_bad_credit.2C_and_i_am_looking_to_repair_it.)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/personalfinance) if you have any questions or concerns.* ", "date": 1483257600.0, "upvotes": 1, "flair": "Payoff credit card debt or establish an emergency fund?"}, {"body": "I'm turning 30 in a few months, my husband is 30 and we are financial dummies. We moved to Australia almost 3 years ago and bought a house in 2015. We have always been savers due to our personal experiences growing up, but for us turning 30 means that we need to start thinking about our future and come up with a better plan. \n\nThis is our situation:\n\n* **Annual Income** ~ $90k (after taxes) + $32k (non-taxed scholarship grad school)\n\n* **Annual expenses** ~ $ 90k (without budgeting much)\n\n* **Current savings** ~ $120k in mortgage offset account (offsetting variable rate part only)\n\n* **Debts** $535k mortgage ($272k fixed rate 4.29% + $263k variable rate 4.02%)\n\n* **Assets** house (bought in 2015 for $700k) + car (bought in 2014 for $20k, paid off)\n\n* **Superannuation account (retirement)** ~ $30k combined \n\n* We don't plan to have children, but I guess we might still change our minds. \n\nSo, here is **the question**: Is it better to leave the $120k in the mortgage offset account instead of putting it into the Superannuation account or invest it in some other way?\n\n", "title": "AU120k sitting in our mortgage offset account: leave it there or invest it?", "comments": "You may find these links helpful:\n\n- [\"How to handle $\"](http://www.reddit.com/r/personalfinance/wiki/commontopics)\n- [Investing wiki page](http://www.reddit.com/r/personalfinance/wiki/investing)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/personalfinance) if you have any questions or concerns.* If you want to top up your super, it's best to arrange with your employer to do this using your pre-tax income, as super contributions are taxed at a lower rate. ", "date": 1483257600.0, "upvotes": 1, "flair": "AU120k sitting in our mortgage offset account: leave it there or invest it?"}, {"body": "I know zilch about this but thought I would ask the PF community. The company isn't do awesome right now but they're still in the black. She wanted to look at getting a grant which if you apply it towards the business it becomes a grant? I don't really know. Do you have more information on this and is it a good idea?", "title": "Mom wants to apply for a govt grant to buy into grandpa's company.", "comments": "Need more info. What does the company even do? Is it a non-profit? Farming related? What sort of grants is she even looking at?\n\nIf she's looking for free money, grants aren't an easy or quick way to get it. They typically have a lot of special conditions attached to them that can make them difficult to apply for and they require you to write a lengthy and often complicated grant proposal to even be considered. And because they're free money they're typically VERY competitive. \n\nI reviewed grants in grad school for extra money and I can tell you that we were looking for any minor mistake in the grant proposal to throw a grant out of consideration. If someone left something out we'd deduct a massive amount of points, especially if the rest in the stack were well written. People make careers on being effective grant writers. It's not the easiest thing to write.\n\nIf your mother can find a grant that seems to apply to your situation and can write a fully complete and well-done grant then it can't hurt to go for it. Just remember that most grants want follow up reports to ensure that you used the money for what you said you would so you'll need to be able to maintain accurate and complete books for the term the grant givers stipulate. ", "date": 1483257600.0, "upvotes": 0, "flair": "Mom wants to apply for a govt grant to buy into grandpa's company."}, 